[{"Id":0,"ExternalId":"tt0076759","Title":"Star Wars: Episode IV - A New Hope","Year":"1977","Runtime":"121 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"George Lucas","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing","Plot":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.","Poster":"https://m.media-amazon.com/images/M/MV5BNzVlY2MwMjktM2E4OS00Y2Y3LWE3ZjctYzhkZGM3YzA1ZWM2XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt0080684","Title":"Star Wars: Episode V - The Empire Strikes Back","Year":"1980","Runtime":"124 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"Leigh Brackett (screenplay by), Lawrence Kasdan (screenplay by), George Lucas (story by)","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams","Plot":"After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader and a bounty hunter named Boba Fett all over the galaxy.","Poster":"https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt0086190","Title":"Star Wars: Episode VI - Return of the Jedi","Year":"1983","Runtime":"131 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"Lawrence Kasdan (screenplay by), George Lucas (screenplay by), George Lucas (story by)","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams","Plot":"After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's trap.","Poster":"https://m.media-amazon.com/images/M/MV5BOWZlMjFiYzgtMTUzNC00Y2IzLTk1NTMtZmNhMTczNTk0ODk1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt2488496","Title":"Star Wars: Episode VII - The Force Awakens","Year":"2015","Runtime":"138 min","Genre":"Action, Adventure, Sci-Fi","Writer":"Lawrence Kasdan, J.J. Abrams, Michael Arndt, George Lucas (based on characters created by)","Actors":"Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver","Plot":"As a new threat to the galaxy rises, Rey, a desert scavenger, and Finn, an ex-stormtrooper, must join Han Solo and Chewbacca to search for the one hope of restoring peace.","Poster":"https://m.media-amazon.com/images/M/MV5BOTAzODEzNDAzMl5BMl5BanBnXkFtZTgwMDU1MTgzNzE@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt0120915","Title":"Star Wars: Episode I - The Phantom Menace","Year":"1999","Runtime":"136 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"George Lucas","Actors":"Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd","Plot":"Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory.","Poster":"https://m.media-amazon.com/images/M/MV5BYTRhNjcwNWQtMGJmMi00NmQyLWE2YzItODVmMTdjNWI0ZDA2XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt0121766","Title":"Star Wars: Episode III - Revenge of the Sith","Year":"2005","Runtime":"140 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"George Lucas","Actors":"Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid","Plot":"Three years into the Clone Wars, the Jedi rescue Palpatine from Count Dooku. As Obi-Wan pursues a new threat, Anakin acts as a double agent between the Jedi Council and Palpatine and is lured into a sinister plan to rule the galaxy.","Poster":"https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt0121765","Title":"Star Wars: Episode II - Attack of the Clones","Year":"2002","Runtime":"142 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"George Lucas (screenplay by), Jonathan Hales (screenplay by), George Lucas (story by)","Actors":"Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee","Plot":"Ten years after initially meeting, Anakin Skywalker shares a forbidden romance with Padmé Amidala, while Obi-Wan Kenobi investigates an assassination attempt on the senator and discovers a secret clone army crafted for the Jedi.","Poster":"https://m.media-amazon.com/images/M/MV5BMDAzM2M0Y2UtZjRmZi00MzVlLTg4MjEtOTE3NzU5ZDVlMTU5XkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt2527336","Title":"Star Wars: Episode VIII - The Last Jedi","Year":"2017","Runtime":"152 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"Rian Johnson, George Lucas (based on characters created by)","Actors":"Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley","Plot":"Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares for battle with the First Order.","Poster":"https://m.media-amazon.com/images/M/MV5BMjQ1MzcxNjg4N15BMl5BanBnXkFtZTgwNzgwMjY4MzI@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt3748528","Title":"Rogue One: A Star Wars Story","Year":"2016","Runtime":"133 min","Genre":"Action, Adventure, Sci-Fi","Writer":"Chris Weitz (screenplay by), Tony Gilroy (screenplay by), John Knoll (story by), Gary Whitta (story by), George Lucas (based on characters created by)","Actors":"Felicity Jones, Diego Luna, Alan Tudyk, Donnie Yen","Plot":"The daughter of an Imperial scientist joins the Rebel Alliance in a risky move to steal the plans for the Death Star.","Poster":"https://m.media-amazon.com/images/M/MV5BMjEwMzMxODIzOV5BMl5BanBnXkFtZTgwNzg3OTAzMDI@._V1_SX300.jpg","IsFavorite":false},{"Id":0,"ExternalId":"tt2527338","Title":"Star Wars: Episode IX - The Rise of Skywalker","Year":"2019","Runtime":"141 min","Genre":"Action, Adventure, Fantasy, Sci-Fi","Writer":"Chris Terrio (screenplay by), J.J. Abrams (screenplay by), Derek Connolly (story by), Colin Trevorrow (story by), J.J. Abrams (story by), Chris Terrio (story by), George Lucas (based on characters created by)","Actors":"Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley","Plot":"The surviving members of the resistance face the First Order once again, and the legendary conflict between the Jedi and the Sith reaches its peak bringing the Skywalker saga to its end.","Poster":"https://m.media-amazon.com/images/M/MV5BMDljNTQ5ODItZmQwMy00M2ExLTljOTQtZTVjNGE2NTg0NGIxXkEyXkFqcGdeQXVyODkzNTgxMDg@._V1_SX300.jpg","IsFavorite":false}]